IRP/src/Documents/SalesOrderClosing/SalesOrderClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>SalesOrderClosing</name>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R2010T_SalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R2014T_CanceledSalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R6510B_StockBalance</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
 <registerRecords>AccumulationRegister.R2011B_SalesOrdersShipment</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R3026B_SalesOrdersCustomerAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R3024B_SalesOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.R2012B_SalesOrdersInvoiceClosing</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>SalesOrder</name>
  <type>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.SalesTransactionTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Cancel</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CancelReason</name>
   <type>
    <types>CatalogRef.CancelReturnReasons</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>DeliveryDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ProcurementMethod</name>
   <type>
    <types>EnumRef.ProcurementMethods</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesOrderKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesPerson</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Enums/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ItemTypes</name>
 <enumValues>
  <name>Service</name>
 </enumValues>
 <enumValues>
  <name>Product</name>
 </enumValues>
 <enumValues>
  <name>Certificate</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/SalesTransactionTypes/SalesTransactionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>SalesTransactionTypes</name>
 <enumValues>
  <name>Sales</name>
 </enumValues>
 <enumValues>
  <name>ShipmentToTradeAgent</name>
 </enumValues>
 <enumValues>
  <name>RetailSales</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRevaluationCustomer</name>
 </enumValues>
 <enumValues>
  <name>CurrencyRevaluationVendor</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/SalesOrderClosing/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;

	Parameters = CurrenciesClientServer.GetParameters_V3(ThisObject);
	CurrenciesClientServer.DeleteRowsByKeyFromCurrenciesTable(ThisObject.Currencies);
	CurrenciesServer.UpdateCurrencyTable(Parameters, ThisObject.Currencies);

	ThisObject.DocumentAmount = CalculationServer.CalculateDocumentAmount(ItemList);
	ThisObject.AdditionalProperties.Insert("OriginalDocumentDate", PostingServer.GetOriginalDocumentDate(ThisObject));
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If DocumentsServer.CheckItemListStores(ThisObject) Then
		Cancel = True;
	EndIf;
	For RowIndex = 0 To (ThisObject.ItemList.Count() - 1) Do
		Row = ThisObject.ItemList[RowIndex];
		If Not ValueIsFilled(Row.ProcurementMethod) And Row.ItemKey.Item.ItemType.Type = Enums.ItemTypes.Product Then
			MessageText = StrTemplate(R().Error_010, R().S_023);
			CommonFunctionsClientServer.ShowUsersMessage(MessageText, "Object.ItemList[" + RowIndex
				+ "].ProcurementMethod", "Object.ItemList");
			Cancel = True;
		EndIf;
		If Row.Cancel And Row.CancelReason.IsEmpty() Then
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_093, "Object.ItemList[" + RowIndex
				+ "].CancelReason", "Object.ItemList");
			Cancel = True;
		EndIf;
	EndDo;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData = Undefined Then
		FillingData = New Structure();
		FillingData.Insert("TransactionType", Enums.SalesTransactionTypes.Sales);
		FillPropertyValues(ThisObject, FillingData);
		ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingData);
	ElsIf TypeOf(FillingData) = Type("Structure") And FillingData.Property("BasedOn") Then
		If FillingData.BasedOn = "SalesOrder" Then 
			ControllerClientServer_V2.SetReadOnlyProperties(ThisObject, FillingData);
			Filling_BasedOn(FillingData);
		EndIf;
	EndIf;
EndProcedure

Procedure Filling_BasedOn(FillingData)
	FillPropertyValues(ThisObject, FillingData);
	
	// ItemList
	For Each Row In FillingData.ItemList Do
		NewRow = ThisObject.ItemList.Add();
		FillPropertyValues(NewRow, Row);
		If Not ValueIsFilled(NewRow.Key) Then
			NewRow.Key = New UUID();
		EndIf;
	EndDo;
	
	// SpecialOffers
	For Each Row In FillingData.SpecialOffers Do
		NewRow = ThisObject.SpecialOffers.Add();
		FillPropertyValues(NewRow, Row);
		If Not ValueIsFilled(NewRow.Key) Then
			NewRow.Key = New UUID();
		EndIf;
	EndDo;
	
	// TaxList
	For Each Row In FillingData.TaxList Do
		NewRow = ThisObject.TaxList.Add();
		FillPropertyValues(NewRow, Row);
		If Not ValueIsFilled(NewRow.Key) Then
			NewRow.Key = New UUID();
		EndIf;
	EndDo;
	
	ThisObject.DocumentAmount = CalculationServer.CalculateDocumentAmount(ThisObject.ItemList);
EndProcedure

Procedure OnCopy(CopiedObject)
	LinkedTables = New Array();
	LinkedTables.Add(SpecialOffers);
	LinkedTables.Add(TaxList);
	LinkedTables.Add(Currencies);
	DocumentsServer.SetNewTableUUID(ItemList, LinkedTables);
EndProcedure
